taskapp/app/views/commons/_tasks_today.html.erb

            <p>
                <% past_total_estimated = Task.where(user_id: @user.id).where.not(action_date: [nil, "2022/08/14"]).sum(:actual_time) %>
                <% s = Task.where(user_id: @user.id).where.not(action_date: [nil, "2022/08/14"]).group(:action_date).size.length %>
---
SELECT SUM("tasks"."actual_time") FROM "tasks" WHERE "tasks"."user_id" = $1 AND NOT (("tasks"."action_date" = $2 OR "tasks"."action_date" IS NULL))  [["user_id", 1], ["action_date", "2022-08-14"]]
SELECT COUNT(*) AS count_all, "tasks"."action_date" AS tasks_action_date FROM "tasks" WHERE "tasks"."user_id" = $1 AND NOT (("tasks"."action_date" = $2 OR "tasks"."action_date" IS NULL)) GROUP BY "tasks"."action_date"  [["user_id", 1], ["action_date", "2022-08-14"]]