app/views/tasks/mypage.html.erb

<div class="box fadeIn">
    <% past_total_estimated = Task.where(user_id: @user.id).where.not(action_date: [nil, "2022/08/14"]).sum(:actual_time) %>
    <% s = Task.where(user_id: @user.id).where.not(action_date: [nil, "2022/08/14"]).group(:action_date).size.length %>
---
SELECT SUM("tasks"."actual_time") FROM "tasks" WHERE "tasks"."user_id" = $1 AND NOT (("tasks"."action_date" = $2 OR "tasks"."action_date" IS NULL))  [["user_id", 1], ["action_date", "2022-08-14"]]
SELECT COUNT(*) AS count_all, "tasks"."action_date" AS tasks_action_date FROM "tasks" WHERE "tasks"."user_id" = $1 AND NOT (("tasks"."action_date" = $2 OR "tasks"."action_date" IS NULL)) GROUP BY "tasks"."action_date"  [["user_id", 1], ["action_date", "2022-08-14"]]

<%# time = Time.now これは本番時に当日の日時を実装する 実装%>
<%= area_chart Task.where(user_id: @user.id).where.not(action_date: [nil, "2022/08/14"]).group(:action_date).order(:action_date).sum(:actual_time), colors: ["#76B852"], ytitle: "実働時間(min)", label: "実績時間(min)" %>
---
SELECT SUM("tasks"."actual_time") AS sum_actual_time, "tasks"."action_date" AS tasks_action_date FROM "tasks" WHERE "tasks"."user_id" = $1 AND NOT (("tasks"."action_date" = $2 OR "tasks"."action_date" IS NULL)) GROUP BY "tasks"."action_date" ORDER BY "tasks"."action_date" ASC  [["user_id", 1], ["action_date", "2022-08-14"]]