taskapp/app/controllers/sessions_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "tomo.k9090@gmail.com"], ["LIMIT", 1]]
---
  def signin(email, password)
    @user = User.find_by(email: email)