taskapp/app/controllers/tasks_controller.rb

  def select_index0
    @index = 0
    @user = current_user
    @task = Task.new
    @tasks = Task.where(user_id: @user.id, status: 0).page(params[:page]).per(20)
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."user_id" = $1 AND "tasks"."status" = $2 LIMIT $3 OFFSET $4  [["user_id", 1], ["status", 0], ["LIMIT", 20], ["OFFSET", 0]]

  def select_index1
    @index = 1
    @user = current_user
    @task = Task.new
    @tasks = Task.where(user_id: @user.id, status: 1).page(params[:page]).per(20)
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."user_id" = $1 AND "tasks"."status" = $2 LIMIT $3 OFFSET $4  [["user_id", 1], ["status", 1], ["LIMIT", 20], ["OFFSET", 0]]

  def select_index2
    @index = 2
    @user = current_user
    @task = Task.new
    @tasks = Task.where(user_id: @user.id, status: 2).page(params[:page]).per(20)
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."user_id" = $1 AND "tasks"."status" = $2 LIMIT $3 OFFSET $4  [["user_id", 1], ["status", 2], ["LIMIT", 20], ["OFFSET", 0]]