taskapp/app/controllers/tasks_controller.rb

  def index
    @user = current_user
    @task = Task.new
    @tasks = Task.where(user_id: @user.id).order(:status, :created_at).page(params[:page]).per(20)
    @tasks_todo = Task.where(user_id: @user.id, status: 0, action_date: "2022/08/14").order(:created_at).page(params[:page]).per(20)
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."user_id" = $1 ORDER BY "tasks"."status" ASC, "tasks"."created_at" ASC LIMIT $2 OFFSET $3  [["user_id", 1], ["LIMIT", 20], ["OFFSET", 20]]
SELECT COUNT(*) FROM "tasks" WHERE "tasks"."user_id" = $1  [["user_id", 1]]
SELECT "tasks".* FROM "tasks" WHERE "tasks"."user_id" = $1 AND "tasks"."status" = $2 AND "tasks"."action_date" = $3 ORDER BY "tasks"."created_at" ASC LIMIT $4 OFFSET $5  [["user_id", 1], ["status", 0], ["action_date", nil], ["LIMIT", 20], ["OFFSET", 0]]
SELECT COUNT(*) AS count_all, "tasks"."action_date" AS tasks_action_date FROM "tasks" WHERE "tasks"."user_id" = $1 AND NOT (("tasks"."action_date" = $2 OR "tasks"."action_date" IS NULL)) GROUP BY "tasks"."action_date"  [["user_id", 1], ["action_date", "2022-08-14"]]

  def create
    @task = current_user.task.build(task_params)
    if @task.save
---
INSERT INTO "tasks" ("user_id", "estimated_time", "task_name", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 1], ["estimated_time", 15], ["task_name", "部屋の掃除"], ["created_at", "2022-08-15 14:43:47.378076"], ["updated_at", "2022-08-15 14:43:47.378076"]]

  def change_status
    status_num = params[:task][:status].to_i
    case status_num

    when 0
      next_status = 1
      @user = current_user
      @task = Task.find(params[:task][:id].to_i)
      Task.where(id: params[:task][:id]).update(status: next_status)
      render "timers/measure"
      # redirect_back(fallback_location: tasks_path)
      # render :index
      # index
    when 1
      next_status = 2
      Task.where(id: params[:task][:id]).update(status: next_status)
      redirect_back(fallback_location: tasks_path)
    when 2
      next_status = 0
      Task.where(id: params[:task][:id]).update(status: next_status)
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "tasks" SET "status" = $1, "updated_at" = $2 WHERE "tasks"."id" = $3  [["status", 1], ["updated_at", "2022-08-14 22:45:13.687178"], ["id", 36]]
SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = $1  [["id", 3]]
UPDATE "tasks" SET "status" = $1, "updated_at" = $2 WHERE "tasks"."id" = $3  [["status", 1], ["updated_at", "2022-08-14 11:14:50.241632"], ["id", 3]]
SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = $1  [["id", 1]]
UPDATE "tasks" SET "status" = $1, "updated_at" = $2 WHERE "tasks"."id" = $3  [["status", 0], ["updated_at", "2022-08-14 21:02:11.542688"], ["id", 1]]

  def today_task_changed
    task_id = params[:task_today][:id]
    action_date = params[:task_today][:action_date]
    if action_date == nil
      Task.where(id: task_id).update(action_date: "2022/08/14")
    else
      Task.where(id: task_id).update(action_date: "")
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = $1  [["id", 29]]
UPDATE "tasks" SET "action_date" = $1, "updated_at" = $2 WHERE "tasks"."id" = $3  [["action_date", "2022-08-14"], ["updated_at", "2022-08-14 22:43:44.520603"], ["id", 29]]
UPDATE "tasks" SET "action_date" = $1, "updated_at" = $2 WHERE "tasks"."id" = $3  [["action_date", nil], ["updated_at", "2022-08-14 22:44:55.465842"], ["id", 29]]

  def set_task
    @task = Task.find(params[:id])
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 136], ["LIMIT", 1]]