taskapp/app/controllers/timers_controller.rb

SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = $1  [["id", 4]]
UPDATE "tasks" SET "actual_time" = $1, "status" = $2, "updated_at" = $3 WHERE "tasks"."id" = $4  [["actual_time", 0], ["status", 2], ["updated_at", "2022-08-15 14:20:04.690297"], ["id", 50]]
---
  def stop
    @start_time = params[:task][:time]
    p Time.parse(@start_time)
    p Time.now
    elapsed_sec = Time.now - Time.parse(@start_time)
    elapsed_min = elapsed_sec/60 #時間（min）
    Task.where(id: params[:task][:id]).update(actual_time: elapsed_min, status: 2) #計測した時間とステータスの変更