taskapp/app/controllers/users_controller.rb

SELECT "users".* FROM "users"
---
    def index
        @users = User.all #.order(:level)

INSERT INTO "users" ("birth_date", "name", "nickname", "email", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
    def create
        @user = User.new(user_params)
        if @user.save